Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/index.html.txt.tmx
Source language: en
Languages: ga

source: A general election must be held within a certain time after the Dáil is dissolved
ga: Ní foláir olltoghchán a bheith ann taobh istigh de thréimhse áirithe ó lánscor na Dála (Teach na parlaiminte Éireannaigh)

source: How the date for the general election is decided and how polling day is designated
ga: Conas atá dáta an Olltoghcháin cinnte agus conas a shonraítear an lá vótaíochta

source: Nomination of candidates for membership of Dáil Éireann
ga: Ainmniúchán mar theachta i nDáil Éireann

source: To be nominated for membership of the Dáil, you may either nominate yourself or a Dáil elector may nominate you
ga: Chun a bheith ainmnithe mar theachta i nDáil Éireann, d'fhéadfá tú féin a ainmniú, nó d'fhéadfadh vótálaí Dála thú a ainmniú

source: Rules governing election expenses by political parties and candidates in Ireland
ga: Tugann an cháipéis seo cur síos ar na rialacha a bhaineann le costais toghcháin páirtithe polaitíochta agus iarrthóirí

source: Voting procedure in a general election
ga: Modh vótála in olltoghchán

source: This document describes voting procedures in a general election in Ireland
ga: Tugann an chaipéis seo cur síos ar an modh vótála in olltoghchán

source: What is a bye-election and in what circumstances is a bye-election held?
ga: Míníonn an cháipéis seo céard is fothoghchán ann agus ceard iad na cúinsí ina bhfuil fothoghchán reáchtáilte

source: How elections to Seanad Éireann (the upper house of the Irish parliament) are made
ga: Tá cur síos anseo ar thoghcháin Seanad Éireann (an teach uachtar na parlaiminte Éireannaigh)

source: Nomination to the Seanad by the Taoiseach
ga: Ainmniúcháin an Taoisigh chuig an Seanad

source: How 11 members of the Seanad (the upper house of the Irish parliament) are nominated by the Taoiseach
ga: Tá cur síos anseo ar an mbealach a n-ainmníonn an Taoiseach aon chomhalta déag den Seanad

source: Seanad - the University Constituency
ga: Seanad - Toghcheantar na nOllscoileanna

source: This document discusses the university graduates who can vote in Seanad elections
ga: Tá cur síos anseo cé na céimithe ollscoile gur féidir leo vóta a chaitheamh i dtoghcháin an tSeanaid

source: Seanad - election of university candidates
ga: Seanad - toghchán iarrthóirí ollscoile

source: How graduates of the Universities of Ireland can elect members of the Seanad
ga: Tá cur síos anseo ar an gcóras atá i bhfeidhm do chéimithe Ollscoileanna na hÉireann baill an tSeanaid a thoghadh

source: How elections are made to the five panels in the Seanad (the upper house of the Irish parliament)
ga: Tá cur síos sa cháipéis seo ar na toghcháin don chúig phainéal sa Seanad (an teach uachtar na parlaiminte Éireannaigh

source: How vacancies in Seanad sub-panels are filled by by-elections
ga: Tá cur síos anseo ar an gcóras le folúntas ar fho-phainéil an tSeanaid a líonadh le fo-thoghcháin

source: The Irish President is elected directly by the people of Ireland
ga: Is iad muintir na hÉireann a thoghann Uachtarán na hÉireann go díreach

source: Overview of the nomination and election process
ga: Forbhreathnú ar an bpróiseas ainmniúcháin agus toghcháin

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Office of the Ombudsman
ga: Bunchearta faoi Bhunreacht na hÉireann
